{"calculatedTweets":[{"id":"1347608259822297088","text":"And here’s a look back at the response to last summer’s Black Lives Matter protests. ","product":-0.010000000298023226,"score":-0.10000000149011612,"magnitude":0.10000000149011612,"category":""},{"id":"1347608257049800707","text":"For those who are wondering why so much attention has been focused on the response of the Capitol Police to the Trump-inspired riots, here’s a data-driven article that provides some useful frame of reference. ","product":0.16000000476837162,"score":0.4000000059604645,"magnitude":0.4000000059604645,"category":""},{"id":"1346983894298595330","text":"Here’s my statement on today’s violence at the Capitol. ","product":-0.4899999833106996,"score":-0.699999988079071,"magnitude":0.699999988079071,"category":""},{"id":"1346883245447778306","text":"My friend John Lewis is surely smiling down on his beloved Georgia this morning, as people across the state carried forward the baton that he and so many others passed down to them. ","product":0.010000000298023226,"score":0.10000000149011612,"magnitude":0.10000000149011612,"category":""},{"id":"1346586029831106562","text":"Georgia voters—If you're in line before the polls close at 7 pm, stay there. You have the right to vote, no matter how long it takes. If you have questions, call the Georgia voter protection hotline at 1-888-730-5816. Let's bring this home.","product":-0.120000006556511,"score":-0.10000000149011612,"magnitude":1.2000000476837158,"category":"/News/Politics"},{"id":"1346581360010473472","text":"Great to see you out there, Tyriek. First-time voters are making a difference today! ","product":1.6199999141693127,"score":0.8999999761581421,"magnitude":1.7999999523162842,"category":""},{"id":"1346577729957855232","text":"Thanks for voting, Emily—and thanks even more for committing to stay involved after today. Your state and your country need you! ","product":0.7200000572204601,"score":0.6000000238418579,"magnitude":1.2000000476837158,"category":""},{"id":"1346472919354937345","text":"Georgia, this is it. Today is Election Day and your vote can help elect and Jon to the U.S. Senate. Make your voice heard today and vote—either in person or by dropping off your mail-in ballot at a ballot drop box. ","product":0.13999999970197674,"score":0.20000000298023224,"magnitude":0.699999988079071,"category":"/News/Politics"},{"id":"1346147427426959362","text":"For those looking for ways to help and Jon get elected, you can find opportunities to volunteer from anywhere at ","product":0.36000002861023006,"score":0.6000000238418579,"magnitude":0.6000000238418579,"category":""},{"id":"1346147425858289665","text":"If you’re a Georgia voter, you can respond tomorrow with the most powerful tool we have as Americans—your vote. Make a plan to vote in person or drop off your mail-in-ballot at a ballot drop box. Check-in with your family and friends to do the same. ","product":0.13999999970197674,"score":0.20000000298023224,"magnitude":0.699999988079071,"category":"/News/Politics"},{"id":"1346147424839065604","text":"Tomorrow is Election Day in Georgia and the stakes could not be higher. We’re seeing how far some will go to retain power and threaten the fundamental principles of our democracy. But our democracy isn’t about any individual, even a president—it’s about you.","product":-0.6800000292062762,"score":-0.4000000059604645,"magnitude":1.7000000476837158,"category":"/News/Politics"},{"id":"1345430228684791808","text":"Georgia, you voted in record numbers to send and to the White House. Now we need you to show up again to vote and Jon to the U.S. Senate. Make your plan to vote on Tuesday, January 5 at ","product":-0.05000000074505806,"score":-0.10000000149011612,"magnitude":0.5,"category":""},{"id":"1345073746441351169","text":"And here’s a story that reminds us of the power of fresh starts, community, and the good that’s in all of us, across the country and around the world. ","product":0.4899999833106996,"score":0.699999988079071,"magnitude":0.699999988079071,"category":""},{"id":"1345073745623453697","text":"After a year that has tested us in unimaginable ways, we've seen how people from all walks of life have stepped up to create change to make things better. Here's to ringing in 2021 with optimism for what's to come and a belief that our best days are still ahead. Happy New Year!","product":1.0800000143051136,"score":0.6000000238418579,"magnitude":1.7999999523162842,"category":"/People & Society"},{"id":"1343967560048521219","text":"The redistricting process in 2021 will be a snapshot of democracy in action, and is working to ensure everyone has a voice. We’ve accomplished a lot together this year, but there's still so much work to do. Join us: ","product":0.040000001192092904,"score":0.10000000149011612,"magnitude":0.4000000059604645,"category":"/News/Politics"},{"id":"1342259178711216128","text":"This Christmas looks different for all of us. As we spend time with those we love—in person or virtually—let us celebrate the blessings we cherish, embrace the spirit of giving, and look out for one another. From my family to yours, Merry Christmas! ","product":0.8500000238418579,"score":0.5,"magnitude":1.7000000476837158,"category":"/People & Society/Religion & Belief"},{"id":"1341451483993260034","text":"It’s unconscionable that there are families worried over the holidays that they’ll be evicted next month. Extending the eviction moratorium was a start, but Congress has to do more to help folks who can’t pay rent because of COVID-related unemployment. ","product":-0.550000011920929,"score":-0.5,"magnitude":1.100000023841858,"category":"/People & Society/Social Issues & Advocacy"},{"id":"1341149075492794374","text":"With COVID cases surging worse than ever, getting vaccinated is one of the most important things we can do. But until the vaccine is widely available, socially distancing and wearing masks will actually save even more lives, and alleviate the pressure on healthcare workers.","product":-0.21000000476837144,"score":-0.30000001192092896,"magnitude":0.699999988079071,"category":"/Health/Public Health"},{"id":"1340386687898312706","text":"Here are some of my favorite songs of the year. As usual, I had some valuable consultation from our family music guru, Sasha, to put this together. I hope you find a new song or two to listen to. ","product":0.5100000345706945,"score":0.30000001192092896,"magnitude":1.7000000476837158,"category":"/Arts & Entertainment/Music & Audio"},{"id":"1339933912928235522","text":"Like everyone else, we were stuck inside a lot this year, and with streaming further blurring the lines between theatrical movies and television features, I’ve expanded the list to include visual storytelling that I’ve enjoyed this year, regardless of format. ","product":-0.09000000715255752,"score":-0.30000001192092896,"magnitude":0.30000001192092896,"category":"/Arts & Entertainment/Movies"},{"id":"1339707405932896256","text":"From Willie Mays to Mamie Johnson, the players and teams in the Negro Leagues changed the game of baseball and paved the way for so many today. Glad to see the officially recognize them as major leaguers. ","product":1.280000038146973,"score":0.800000011920929,"magnitude":1.600000023841858,"category":"/Sports/Team Sports/Baseball"},{"id":"1339631669104570370","text":"As 2020 comes to a close, I wanted to share my annual lists of favorites. I’ll start by sharing my favorite books this year, deliberately omitting what I think is a pretty good book – A Promised Land – by a certain 44th president. I hope you enjoy reading these as much as I did. ","product":1.0800000143051136,"score":0.6000000238418579,"magnitude":1.7999999523162842,"category":""},{"id":"1339265635415633921","text":"I had some fun answering questions about #APromisedLand for BookTube. I talked to creators about everything from fatherhood, to celebrating science at the White House, to the role strong women played in my life. You can watch the full episode on : ","product":1.0800000143051136,"score":0.6000000238418579,"magnitude":1.7999999523162842,"category":"/Arts & Entertainment"},{"id":"1338612721600884736","text":"There’s just one day left to sign up for heath care during open enrollment. If you or someone you know needs coverage, head to right now to sign up for an affordable plan that works for you and your family.","product":0.10000000149011612,"score":0.10000000149011612,"magnitude":1,"category":""},{"id":"1337509978454810626","text":"Here’s a great way to call voters in Georgia and help them get ready to vote. A couple hours this weekend could help Democrats win the Senate. ","product":0.5,"score":0.5,"magnitude":1,"category":"/News/Politics"},{"id":"1337140440169123846","text":"Happy Hanukkah to all those celebrating around the world. This year has tested us all, but it's also clarified what really matters. May the lights of the menorah remind us to cherish the blessings we have and offer glimmers of hope. From my family to yours, Chag Sameach!","product":2.1699998962879192,"score":0.699999988079071,"magnitude":3.0999999046325684,"category":"/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events"},{"id":"1336370071917240321","text":"With COVID-19 cases reaching an all-time high this week, we've got to continue to do our part to protect one another. This pandemic is far from over and your actions can help save lives. ","product":0.7200000572204601,"score":0.6000000238418579,"magnitude":1.2000000476837158,"category":""},{"id":"1335954913344565258","text":"To all of you in Georgia, today is the last day to register to vote in the upcoming runoff election. Take a few minutes right now to register to vote, and then make sure everybody you know is registered, too. ","product":-0.10000000149011612,"score":-0.20000000298023224,"magnitude":0.5,"category":"/News"},{"id":"1334935534809083904","text":"Thanks for sharing Marjon. I hope you get something out of A Promised Land – keep up the good work! ","product":1.3600000584125524,"score":0.800000011920929,"magnitude":1.7000000476837158,"category":""},{"id":"1334928550227550209","text":"Glad to see A Promised Land in such good company. ","product":0.8099999570846563,"score":0.8999999761581421,"magnitude":0.8999999761581421,"category":""},{"id":"1334614943379968003","text":"Join me for a conversation with the next U.S. Senators from Georgia, and , along with and . The stakes couldn’t be higher for their runoffs: ","product":0.020000000596046452,"score":0.10000000149011612,"magnitude":0.20000000298023224,"category":""},{"id":"1333833279775141888","text":"We started the to help a new generation build a better tomorrow. And many of them already are, stepping up through the pandemic and protests to demand real change. On Giving Tuesday, I'm asking you to invest in them: ","product":-0.1299999971687793,"score":-0.10000000149011612,"magnitude":1.2999999523162842,"category":""},{"id":"1331681995857022987","text":"Let’s all do our part this Thanksgiving to keep people safe and healthy. Celebrate virtually, if you can. Wear a mask. And as always, listen to the experts. The choices you make could save lives.","product":0.960000052452088,"score":0.4000000059604645,"magnitude":2.4000000953674316,"category":"/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events"},{"id":"1330953347558494213","text":"The balance of power in the Senate is at stake in Georgia’s runoff election. We’ve got two great candidates— and —who need your support. Go to to find ways to get involved.","product":0.30000001192092896,"score":0.30000001192092896,"magnitude":1,"category":"/News/Politics"},{"id":"1329831998400114690","text":"Michelle and I are eager to bring the Obama Presidential Center to our hometown—a way to honor the city we love, all those who came before us, and pay tribute to people coming together to do extraordinary things. ","product":0.6400000190734865,"score":0.800000011920929,"magnitude":0.800000011920929,"category":"/News/Politics"},{"id":"1329447407105486849","text":"This was fun. I heard Tim and Fred were listening to some of the songs on my A Promised Land playlist, so I decided to drop in and surprise them. We talked about a lot, from Bob Dylan to old-school mixtapes to the role music played in my memoir. ","product":0.800000011920929,"score":0.5,"magnitude":1.600000023841858,"category":"/Arts & Entertainment/Music & Audio"},{"id":"1328684558166986755","text":"My memoir, A Promised Land, is out today. I hope you’ll read it. My goal was to give you some insight into the events and people that shaped me during the early years of my presidency. Most of all, I hope it inspires you to see yourself playing a role in shaping a better world. ","product":0.7600000017881392,"score":0.4000000059604645,"magnitude":1.899999976158142,"category":""},{"id":"1328458351869644806","text":"Music has always played an important role in my life—and that was especially true during my presidency. In honor of my book hitting shelves tomorrow, I put together this playlist featuring some memorable songs from my administration. Hope you enjoy it. ","product":2.0000000298023224,"score":0.800000011920929,"magnitude":2.5,"category":"/Arts & Entertainment/Music & Audio"},{"id":"1326993403268259840","text":"More than anyone else, I wrote my book for young people—as an invitation to once again remake the world, and to bring about, through hard work, determination, and a big dose of imagination, an America that finally aligns with all that is best in us. ","product":0.6400000190734865,"score":0.800000011920929,"magnitude":0.800000011920929,"category":""},{"id":"1326555766866780161","text":"Today, we’re reminded of our solemn obligation: to serve our veterans as well as they have served us. To all of our veterans and service members, we’re forever grateful for your commitment to our country—and your willingness to put it all on the line for us. Thank you.","product":0.8999999761581421,"score":0.5,"magnitude":1.7999999523162842,"category":"/Law & Government/Military"},{"id":"1325136780396437507","text":"Congratulations to my friends, and — our next President and Vice President of the United States. ","product":0.6400000190734865,"score":0.800000011920929,"magnitude":0.800000011920929,"category":""},{"id":"1323781320678531077","text":"Thank you Chiney, Nneka, and all of the athletes who are using their platforms and helping people vote in this election. ","product":0.6400000190734865,"score":0.800000011920929,"magnitude":0.800000011920929,"category":""},{"id":"1323777143566934020","text":"Rahul, you're helping make democracy work today. Thank you. ","product":1.0499999821186066,"score":0.699999988079071,"magnitude":1.5,"category":""},{"id":"1323770228191465472","text":"There's a reason some folks are trying to make it hard for you to vote: They know that if you do, things change. And that's why the answer isn't to stay at home. It's to turn out like never before and show them what this country stands for.","product":-0.800000011920929,"score":-0.5,"magnitude":1.600000023841858,"category":"/Arts & Entertainment"},{"id":"1323770226555703296","text":"If you are in line to vote before polls close, you have the right to vote. Stay in line for as long as it takes. If you have any questions, call the voter hotline at 833-336-8683. We’ve got this. ","product":-0.040000001192092904,"score":-0.10000000149011612,"magnitude":0.4000000059604645,"category":"/News/Politics"},{"id":"1323726205993033728","text":"This Election Day, everything is on the line. Our jobs. Our health care. Whether or not we get this pandemic under control. But here’s the good news: today, you can choose change. You can elect and . Let’s win this thing. ","product":0.7800000023841847,"score":0.30000001192092896,"magnitude":2.5999999046325684,"category":"/News/Politics"},{"id":"1323687618526269442","text":"For eight years, Joe was the last one in the room whenever I faced a big decision. He made me a better president. And today, we have the chance to elect Joe and Kamala to build our country back better. But it’s going to take every single one of us. Vote: ","product":0.4199999871850011,"score":0.20000000298023224,"magnitude":2.0999999046325684,"category":""},{"id":"1323455502874005505","text":"Our administration literally left this White House a playbook that would have shown them how to respond before COVID-19 reached our shores. Joe and I revisited it recently. Take a look — and then vote for a leader who will get this virus under control. ","product":-0.20000000298023224,"score":-0.20000000298023224,"magnitude":1,"category":""},{"id":"1323384479533142018","text":"Maaza, this is beautiful. Thank you for voting—and thank you for staying hopeful. ","product":1.7099999332427984,"score":0.8999999761581421,"magnitude":1.899999976158142,"category":""},{"id":"1323373267219001344","text":"Congrats on your first vote, Dewey! It will make a difference. ","product":1.0499999821186066,"score":0.699999988079071,"magnitude":1.5,"category":""},{"id":"1323341181292552194","text":"We’ve got to vote up and down the ticket like never before for Democratic candidates. Join me for a drive-in rally in Georgia with and . ","product":-0.120000006556511,"score":-0.20000000298023224,"magnitude":0.6000000238418579,"category":""},{"id":"1323324599891877895","text":"We can’t afford to be complacent. Not this time. Not in this election. Make a plan right now: ","product":-1,"score":-0.5,"magnitude":2,"category":""},{"id":"1322679224692604928","text":"Shoot your shot. ","product":-0.040000001192092904,"score":-0.20000000298023224,"magnitude":0.20000000298023224,"category":""},{"id":"1322646949707812868","text":"Fired up to be with my friends and in Detroit to make sure everybody turns out to vote in this election. Tune in live. ","product":0.08000000238418581,"score":0.20000000298023224,"magnitude":0.4000000059604645,"category":""},{"id":"1322621879857852416","text":"Don't boo — vote! Happy Halloween, everybody. ","product":0.17000000730156906,"score":0.10000000149011612,"magnitude":1.7000000476837158,"category":""},{"id":"1322342828782084097","text":"Always great talking to and about everything from this unique NBA season to the importance of voting in every election. Tune in tonight and make your plan to vote: ","product":0.550000011920929,"score":0.5,"magnitude":1.100000023841858,"category":"/Sports/Team Sports/Basketball"},{"id":"1322282938432737286","text":"Second, volunteer—you can make calls or text voters who can use a nudge to vote for Joe. You can be the difference between someone turning in their ballot or showing up to the polls on Tuesday—or not voting. Head to for ways to help the campaign.","product":0.040000001192092904,"score":0.10000000149011612,"magnitude":0.4000000059604645,"category":"/News/Politics"},{"id":"1322282936629137409","text":"If you're wondering how you can support in these final days of the campaign, here are two ways you can help. First, donate what you can. It’ll help the team reach the voters we most need to connect with: ","product":0.3300000202655795,"score":0.30000001192092896,"magnitude":1.100000023841858,"category":""},{"id":"1321512358913679366","text":"Thanks for making your voice heard, Adam. I know a thing or two about being hopeful in the rain, too. ","product":0.5,"score":0.5,"magnitude":1,"category":"/Arts & Entertainment"},{"id":"1321504536780017665","text":"This right here is what it's all about. Tell your mom thank you for voting, Leta. ","product":0.550000011920929,"score":0.5,"magnitude":1.100000023841858,"category":""},{"id":"1321497617721888768","text":"Stella, thank you for being a poll worker. You’re making a difference and helping folks cast their ballot safely. ","product":1.6199999141693127,"score":0.8999999761581421,"magnitude":1.7999999523162842,"category":""},{"id":"1320841468530012160","text":"Republicans love to say right before an election that they’ll protect preexisting conditions. Well, Joe and I actually did it — and he’ll keep protecting your health care as president. We’ve got eight days left. Vote. ","product":0.480000026226044,"score":0.30000001192092896,"magnitude":1.600000023841858,"category":"/News/Politics"},{"id":"1320698630014193664","text":"In the middle of a pandemic, this administration is trying to dismantle the Affordable Care Act in the Supreme Court. Here’s how Joe and I fought to expand health care, protect millions of Americans with preexisting conditions, and actually get it done: ","product":-0.3599999958276747,"score":-0.4000000059604645,"magnitude":0.8999999761581421,"category":"/Law & Government"},{"id":"1320477828626948096","text":"Felicidades, Sofia — I'll bet your car decorations alone inspired a few folks to head to the polls! Thank you for making your voice heard. It matters. ","product":1.1400000309944147,"score":0.6000000238418579,"magnitude":1.899999976158142,"category":""},{"id":"1320474054206345217","text":"Dawn, you're showing us all how it's done — not just making your own voice heard, but helping others do so, too. Kidney cancer doesn't stand a chance. You've got this. ","product":0.17999999791383736,"score":0.10000000149011612,"magnitude":1.7999999523162842,"category":""},{"id":"1320440566723825665","text":"Eight months into the pandemic, as new cases are breaking records, we need an administration that’s not going to wave the white flag. A year ago today, was talking about the leadership we need to get prepared for a pandemic, and he’s got a plan to get it under control. ","product":-0.21000000476837144,"score":-0.30000001192092896,"magnitude":0.699999988079071,"category":"/Law & Government/Public Safety"},{"id":"1320364787952504833","text":"In 2020, we show up early — for everything, but especially for voting. Get out there and vote! ","product":0.03000000163912775,"score":0.10000000149011612,"magnitude":0.30000001192092896,"category":""},{"id":"1319781191420203010","text":"One election won't make everything perfect—but it could make things better. And that's why it’s worth taking a few minutes to vote. It's the best route for us to achieve the changes we want. Make your plan to vote at Let’s bring this home. ","product":0.6400000190734865,"score":0.4000000059604645,"magnitude":1.600000023841858,"category":"/News/Politics"},{"id":"1319703107232780293","text":"We’re just days away from the election and I know there are a lot of good lawyers out there who want to make sure that voting is safe, secure, and accessible for everybody. If that’s you, I hope you’ll sign up with to protect the vote: ","product":0.18000001430511503,"score":0.30000001192092896,"magnitude":0.6000000238418579,"category":""},{"id":"1319663574562803714","text":"Joe has the character and the experience to make our country better - but first, he needs your vote. Make a plan to vote right now and vote as early as you can. ","product":0.08000000238418581,"score":0.20000000298023224,"magnitude":0.4000000059604645,"category":"/Arts & Entertainment"},{"id":"1319247155828228096","text":"I just voted by mail for and . If you're planning on doing the same, follow all the instructions carefully, and drop it in the mail or at a ballot drop box right away. Here, I’ll show you: ","product":0.040000001192092904,"score":0.10000000149011612,"magnitude":0.4000000059604645,"category":""},{"id":"1319079038992994304","text":"Great to be back in Philly today. I'm fired up and ready to go! ","product":1.3600000584125524,"score":0.800000011920929,"magnitude":1.7000000476837158,"category":""},{"id":"1319032761269784579","text":"13 days until the most important election of our lifetimes. And you don’t have to wait until November 3rd to cast your ballot. Make a plan, vote, and then help your friends and family make a plan at Let’s do this. ","product":0.13999999970197674,"score":0.20000000298023224,"magnitude":0.699999988079071,"category":"/News/Politics"},{"id":"1318933183040282626","text":"102 never looked better! Grateful for all the folks like your great aunt who continue to show up and vote in this important election. ","product":1.6199999141693127,"score":0.8999999761581421,"magnitude":1.7999999523162842,"category":""},{"id":"1318741515649372166","text":"One of the most inspiring things about this year has been seeing so many young people organizing, marching, and fighting for change. And to change the game on any of the issues we care about, we've got to vote for and . ","product":0.240000013113022,"score":0.20000000298023224,"magnitude":1.2000000476837158,"category":""},{"id":"1318265822310240256","text":"Bob Bauer and 's new book is a thoughtful and comprehensive look at the issues at stake as we debate the role of the presidency in the coming years. It's worth a read. ","product":1.0499999821186066,"score":0.699999988079071,"magnitude":1.5,"category":"/Books & Literature"}],"averageScore":0.2973684231309514}
